# LineWeight Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FilledRegionType..::..LineWeight Property
FilledRegionType Class See Also
---
The line weight of the fill pattern.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public int LineWeight { get; set; }
```

Visual Basic
---
```text
Public Property LineWeight As Integer
	Get
	Set
```

Visual C++
---
```text
public:
property int LineWeight {
	int get ();
	void set (int value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: lineWeight is not a valid line weight value (it must be within the range of 1-16). |

# See Also
FilledRegionType Class
Autodesk.Revit.DB Namespace